import React from "react";

import arrayImg from "../asset/resource/arrayImg.png";
import listImg from "../asset/resource/listImg.png";
import stackImg from "../asset/resource/stackImg.png";
import queueImg from "../asset/resource/queueImg.png";
import treeImg from "../asset/resource/treeImg.png";
import graphImg from "../asset/resource/graphImg.png";
import hash_tableImg from "../asset/resource/hash_tableImg.png";

import { structureConfig, structureType } from "../types/dataTypes";
import { Settings } from "../components/UI/Settings";

//Зроби опис для методів(алгоритмів)

const arrayConfig: structureConfig<"Array"> = {
  type: "Array",
  imgURL: arrayImg,
  description: (
    <div>
      <h2>Масив</h2>
      <p>
        Масив - це структура, що зберігає впорядкований набір елементів одного
        типу.
      </p>
      <p>
        Масив має фіксований розмір елементів, що зберігаються в пам'яті
        суцільним блоком один за одним.
      </p>
      <p>
        Кожен елемент має свій індекс, за яким здійснюється доступ до нього.
      </p>
      <p>Масиви бувають статичними та динамічними.</p>
      <dl>
        <dt>
          <h3>Статичний масив</h3>
        </dt>
        <dd>
          Масив, що має фіксований розмір, який не можна змінити після
          створення.
        </dd>
        <dt>
          <h3>Динамічний масив</h3>
        </dt>
        <dd>
          Масив, що може автоматично збільшувати свою місткість під час
          переповнення, зазвичай шляхом її подвоєння.
        </dd>
      </dl>
    </div>
  ),
  settings: <></>,
  subType: {
    static: {
      properties: [
        { id: 0, property: "data", description: "Дані масиву" },
        {
          id: 1,
          property: "length",
          description: "Поточна кількість даних масиву",
        },
        {
          id: 2,
          property: "maxSize",
          description: "Максимальна кількість даних масиву",
        },
        {
          id: 3,
          property: "isSorted",
          description: "Чи є масив відсортованим",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "unshift(v)",
              description: "Додати елемент v напочаток",
            },
            {
              id: 1,
              method: "shift()",
              description: "Видалити перший елемент",
            },
            {
              id: 2,
              method: "push(v)",
              description: "Додати елемент v вкінець",
            },
            {
              id: 3,
              method: "pop()",
              description: "Видалити останній елемент",
            },
            {
              id: 4,
              method: "insert(v, i)",
              description: "Додати елемент v по індексу i",
            },
            {
              id: 5,
              method: "remove(i)",
              description: "Видалити елемент з індексом i",
            },
            {
              id: 6,
              method: "update(i, v)",
              description:
                "Оновити значення елемента з індексом i на значення v",
            },
            {
              id: 7,
              method: "get(i)",
              description: "Отримати елемент з інлексом i",
            },
            {
              id: 8,
              method: "swap(i1, i2)",
              description: "Поміняти місцями елементи з індексами i1 та i2",
            },
            {
              id: 9,
              method: "reverse()",
              description: "Відзеркалити дані масиву",
            },
            {
              id: 10,
              method: "clean()",
              description: "Очистити масив від усіх даних",
            },
            { id: 11, method: "isEmpty()", description: "Чи є масив порожнім" },
            { id: 12, method: "isFull()", description: "Чи є масив повним" },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у масиві елемент v",
            },
            {
              id: 1,
              method: "findIndex(v)",
              description: "Повертає індекс елемента v",
            },
            {
              id: 2,
              method: "linearSearch(v)",
              description:
                "Проходиться по кожному елементу масиву, доки не знайде елемент v",
            },
            {
              id: 3,
              method: "binarySearch(v)",
              description:
                "Перевіряє на рівність елемент v з центральним елеиментом відортованого масиву, якщо v менше, то перевіряємо на рівність центральний елемент лівого підмасиву, якщо більше - центральний елемент правого підмасиву і так до тих пір, доки елемент v і центральний елемент підмасиву не будуть рівними",
            },
          ],
        },
        {
          id: 2,
          block: "Сорутвання",
          methods: [
            {
              id: 0,
              method: "bubleSort(d)",
              description:
                "Перевіряє два сусідних елементи, починаючи з перших, і міняє їх місями, якщо вони розташовані у непарвильному поярдку, перевіряючи так всі сусідні пари до кінця масиву. Процес повторюється для решти масиву без урахування відсортованих елементів. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 1,
              method: "selectionSort(d)",
              description:
                "Лінійно проходится по всьому маисву, шукаючи найменший елемент, щоб поміняти його місцями з першим/останнім невідсортованим елементом масиву. Процес повторюється до тих пір, доки масив не буде відсортуваний у правильному порядку. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 2,
              method: "insertionSort(d)",
              description:
                "Перший елемент масиву вважається вже відсортованим за замовчуванням. Береться наступний елемент і порівнюється з відсортованими елементами зліва. Елемент вставляється на правильне місце, зсуваючи всі інші елементи правруч. Процес повторюється для всіх елементів масиву, доки масив не відсортується повністю. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 3,
              method: "quickSort(d)",
              description:
                "У масиві обирається опорний елемент (pivot), а всі інші елементи переміщуються вліво, якщо вони менші або вправо - якщо більші. Сортування повторюється рекурсивно для отриманих підмасивів, доки вони не будуть повністю відсортовані у праивльному порядку. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 4,
              method: "mergeSort(d)",
              description:
                "Розбиває масив на менші частини, доки не залишиться лише масиви з одним елементом. Масиви з одним елементами зливаються, утворюючи відсортовані масив з більшою кількістю елементів. Процес повторюється до тих пір, доки не отримаємо один повністю відсортований масив. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
          ],
        },
      ],
    },
    dynamic: {
      properties: [
        { id: 0, property: "data", description: "Дані масиву" },
        {
          id: 1,
          property: "length",
          description: "Поточна кількість даних масиву",
        },
        {
          id: 2,
          property: "maxSize",
          description: "Максимальна кількість даних масиву",
        },
        {
          id: 3,
          property: "isSorted",
          description: "Чи є масив відсортованим",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "unshift(v)",
              description: "Додати елемент v напочаток",
            },
            {
              id: 1,
              method: "shift()",
              description: "Видалити перший елемент",
            },
            {
              id: 2,
              method: "push(v)",
              description: "Додати елемент v вкінець",
            },
            {
              id: 3,
              method: "pop()",
              description: "Видалити останній елемент",
            },
            {
              id: 4,
              method: "insert(v, i)",
              description: "Додати елемент v по індексу i",
            },
            {
              id: 5,
              method: "remove(i)",
              description: "Видалити елемент з індексом i",
            },
            {
              id: 6,
              method: "update(i, v)",
              description:
                "Оновити значення елемента з індексом i на значення v",
            },
            {
              id: 7,
              method: "get(i)",
              description: "Отримати елемент з інлексом i",
            },
            {
              id: 8,
              method: "swap(i1, i2)",
              description: "Поміняти місцями елементи з індексами i1 та i2",
            },
            {
              id: 9,
              method: "reverse()",
              description: "Відзеркалити дані масиву",
            },
            {
              id: 10,
              method: "clean()",
              description: "Очистити масив від усіх даних",
            },
            { id: 11, method: "isEmpty()", description: "Чи є масив порожнім" },
            { id: 12, method: "isFull()", description: "Чи є масив повним" },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у масиві елемент v",
            },
            {
              id: 1,
              method: "findIndex(v)",
              description: "Повертає індекс елемента v",
            },
            {
              id: 2,
              method: "linearSearch(v)",
              description:
                "Проходиться по кожному елементу масиву, доки не знайде елемент v",
            },
            {
              id: 3,
              method: "binarySearch(v)",
              description:
                "Перевіряє на рівність елемент v з центральним елеиментом відортованого масиву, якщо v менше, то перевіряємо на рівність центральний елемент лівого підмасиву, якщо більше - центральний елемент правого підмасиву і так до тих пір, доки елемент v і центральний елемент підмасиву не будуть рівними",
            },
          ],
        },
        {
          id: 2,
          block: "Сорутвання",
          methods: [
            {
              id: 0,
              method: "bubleSort(d)",
              description:
                "Перевіряє два сусідних елементи, починаючи з перших, і міняє їх місями, якщо вони розташовані у непарвильному поярдку, перевіряючи так всі сусідні пари до кінця масиву. Процес повторюється для решти масиву без урахування відсортованих елементів. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 1,
              method: "selectionSort(d)",
              description:
                "Лінійно проходится по всьому маисву, шукаючи найменший елемент, щоб поміняти його місцями з першим/останнім невідсортованим елементом масиву. Процес повторюється до тих пір, доки масив не буде відсортуваний у правильному порядку. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 2,
              method: "insertionSort(d)",
              description:
                "Перший елемент масиву вважається вже відсортованим за замовчуванням. Береться наступний елемент і порівнюється з відсортованими елементами зліва. Елемент вставляється на правильне місце, зсуваючи всі інші елементи правруч. Процес повторюється для всіх елементів масиву, доки масив не відсортується повністю. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 3,
              method: "quickSort(d)",
              description:
                "У масиві обирається опорний елемент (pivot), а всі інші елементи переміщуються вліво, якщо вони менші або вправо - якщо більші. Сортування повторюється рекурсивно для отриманих підмасивів, доки вони не будуть повністю відсортовані у праивльному порядку. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 4,
              method: "mergeSort(d)",
              description:
                "Розбиває масив на менші частини, доки не залишиться лише масиви з одним елементом. Масиви з одним елементами зливаються, утворюючи відсортовані масив з більшою кількістю елементів. Процес повторюється до тих пір, доки не отримаємо один повністю відсортований масив. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
          ],
        },
      ],
    },
  },
};

const listConfig: structureConfig<"List"> = {
  type: "List",
  imgURL: listImg,
  description: (
    <div>
      <h2>Спосок</h2>
      <p>
        Список - це структура, що зберігає впорядкований набір елементів одного
        типу.
      </p>
      <p>
        Список має фіксований розмір елементів, що розташовуються в різних
        ділянках пам'яті та з'єднуються між собою за допомогою посилань.
      </p>
      <p>
        Кожен елемент має одне або два посилання на сусідні елементи залежно від
        типу списку.
      </p>
      <p>Списки можуть бути:</p>
      <ul>
        <li>однонапрямлені або двонапрямлені</li>
        <li>зациклиними або незациклиними</li>
      </ul>
      <p>
        В однонапрямленому списку кожен елемент містить посилання лише на
        наступний елемент.
      </p>
      <p>
        У двонапрямленому списку кожен елемент містить посилання як на
        наступний, так і на попередній елемент.
      </p>
      <p>
        У зацикленому списку перший та останній елементи мають посилання на один
        одного.
      </p>
      <p>
        У незацикленому списку перший та останній елементи посилаються на null.
      </p>
    </div>
  ),
  settings: <div>Settings</div>,
  subType: {
    singly: {
      properties: [
        {
          id: 0,
          property: "head",
          description: "Вказівник на найперший елемент списку",
        },
        {
          id: 1,
          property: "tail",
          description: "Вказівник на останній елемент списку",
        },
        {
          id: 2,
          property: "isDoubly",
          description: "Чи є елемент двонапрямленим",
        },
        {
          id: 3,
          property: "isCircular",
          description: "Чи є елемент циклічним",
        },
      ],
      nodeProps: [
        { id: 0, nodeProp: "value", description: "Значення вузла" },
        {
          id: 1,
          nodeProp: "next",
          description: "Посилання на наступний вузол",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "prepend(v)",
              description: "Додати елемент v напочаток",
            },
            {
              id: 1,
              method: "shift()",
              description: "Видалити перший елемент",
            },
            {
              id: 2,
              method: "apend(v)",
              description: "Додати елемент v вкінець",
            },
            {
              id: 3,
              method: "pop()",
              description: "Видалити останній елемент",
            },
            {
              id: 4,
              method: "insert(i, v)",
              description: "Додати елемент v по індексу i",
            },
            {
              id: 5,
              method: "remove(i)",
              description: "Видалити елемент з індексом i",
            },
            {
              id: 6,
              method: "update(i, v)",
              description:
                "Оновити значення елемента з індексом i на значення v",
            },
            {
              id: 7,
              method: "get(i)",
              description: "Отримати елемент з інлексом i",
            },
            {
              id: 8,
              method: "swap(i1, i2)",
              description: "Поміняти місцями елементи з індексами i1 та i2",
            },
            {
              id: 9,
              method: "reverse()",
              description: "Відзеркалити дані списку",
            },
            {
              id: 10,
              method: "clean()",
              description: "Очистити список від усіх даних",
            },
            {
              id: 11,
              method: "isEmpty()",
              description: "Чи є список порожнім",
            },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у списку елемент i",
            },
            {
              id: 1,
              method: "findIndex(v)",
              description: "Повертає індекс елемента v",
            },
            {
              id: 2,
              method: "linearSearch(v)",
              description:
                "Проходиться по кожному елементу списку, доки не знайде елемент v",
            },
          ],
        },
        {
          id: 2,
          block: "Сорутвання",
          methods: [
            {
              id: 0,
              method: "bubleSort(d)",
              description:
                "Перевіряє два сусідних елементи, починаючи з перших, і міняє їх місями, міняючи їх посилання місцями, якщо вони розташовані у непарвильному поярдку, перевіряючи так всі сусідні пари до кінця списку. Процес повторюється для решти списку без урахування відсортованих елементів. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 1,
              method: "insertionSort(d)",
              description:
                "Перший елемент списку вважається вже відсортованим за замовчуванням. Береться наступний елемент і порівнюється з відсортованими елементами зліва. Елемент вставляється на правильне місце, міняючи своє посилання на елемент справа, а посилання попереднього елемента на цей елемент. Процес повторюється для всіх елементів списку, доки список не відсортується повністю. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 2,
              method: "mergeSort(d)",
              description:
                "Розбиває список на менші частини, доки не залишиться лише списки з одним елементом. Списки з одним елементами зливаються, утворюючи відсортовані списки з більшою кількістю елементів, міняючи свої посилання. Процес повторюється до тих пір, доки не отримаємо один повністю відсортований список. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
          ],
        },
      ],
    },
    doubly: {
      properties: [
        {
          id: 0,
          property: "head",
          description: "Вказівник на найперший елемент списку",
        },
        {
          id: 1,
          property: "tail",
          description: "Вказівник на останній елемент списку",
        },
        {
          id: 2,
          property: "isDoubly",
          description: "Чи є елемент двонапрямленим",
        },
        {
          id: 3,
          property: "isCircular",
          description: "Чи є елемент циклічним",
        },
      ],
      nodeProps: [
        { id: 0, nodeProp: "value", description: "Значення вузла" },
        {
          id: 1,
          nodeProp: "next",
          description: "Посилання на наступний вузол",
        },
        {
          id: 2,
          nodeProp: "prev",
          description: "Посилання на попередній вузол",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "prepend(v)",
              description: "Додати елемент v напочаток",
            },
            {
              id: 1,
              method: "shift()",
              description: "Видалити перший елемент",
            },
            {
              id: 2,
              method: "apend(v)",
              description: "Додати елемент v вкінець",
            },
            {
              id: 3,
              method: "pop()",
              description: "Видалити останній елемент",
            },
            {
              id: 4,
              method: "insert(i, v)",
              description: "Додати елемент v по індексу i",
            },
            {
              id: 5,
              method: "remove(i)",
              description: "Видалити елемент з індексом i",
            },
            {
              id: 6,
              method: "update(i, v)",
              description:
                "Оновити значення елемента з індексом i на значення v",
            },
            {
              id: 7,
              method: "get(i)",
              description: "Отримати елемент з інлексом i",
            },
            {
              id: 8,
              method: "swap(i1, i2)",
              description: "Поміняти місцями елементи з індексами i1 та i2",
            },
            {
              id: 9,
              method: "reverse()",
              description: "Відзеркалити дані списку",
            },
            {
              id: 10,
              method: "clean()",
              description: "Очистити список від усіх даних",
            },
            {
              id: 11,
              method: "isEmpty()",
              description: "Чи є список порожнім",
            },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у списку елемент i",
            },
            {
              id: 1,
              method: "findIndex(v)",
              description: "Повертає індекс елемента v",
            },
            {
              id: 2,
              method: "linearSearch(v)",
              description:
                "Проходиться по кожному елементу списку, доки не знайде елемент v",
            },
          ],
        },
        {
          id: 2,
          block: "Сорутвання",
          methods: [
            {
              id: 0,
              method: "bubleSort(d)",
              description:
                "Перевіряє два сусідних елементи, починаючи з перших, і міняє їх місями, міняючи їх посилання місцями, якщо вони розташовані у непарвильному поярдку, перевіряючи так всі сусідні пари до кінця списку. Процес повторюється для решти списку без урахування відсортованих елементів. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 1,
              method: "insertionSort(d)",
              description:
                "Перший елемент списку вважається вже відсортованим за замовчуванням. Береться наступний елемент і порівнюється з відсортованими елементами зліва. Елемент вставляється на правильне місце, міняючи свої посилання на елементи зліва та справа, а посилання елементів зліва та справа на цей елемент. Процес повторюється для всіх елементів списку, доки список не відсортується повністю. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 2,
              method: "mergeSort(d)",
              description:
                "Розбиває список на менші частини, доки не залишиться лише списки з одним елементом. Списки з одним елементами зливаються, утворюючи відсортовані списки з більшою кількістю елементів, міняючи свої посилання. Процес повторюється до тих пір, доки не отримаємо один повністю відсортований список. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
          ],
        },
      ],
    },
    "singly-circular": {
      properties: [
        {
          id: 0,
          property: "head",
          description: "Вказівник на найперший елемент списку",
        },
        {
          id: 1,
          property: "tail",
          description: "Вказівник на останній елемент списку",
        },
        {
          id: 2,
          property: "isDoubly",
          description: "Чи є елемент двонапрямленим",
        },
        {
          id: 3,
          property: "isCircular",
          description: "Чи є елемент циклічним",
        },
      ],
      nodeProps: [
        { id: 0, nodeProp: "value", description: "Значення вузла" },
        {
          id: 1,
          nodeProp: "next",
          description: "Посилання на наступний вузол",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "prepend(v)",
              description: "Додати елемент v напочаток",
            },
            {
              id: 1,
              method: "shift()",
              description: "Видалити перший елемент",
            },
            {
              id: 2,
              method: "apend(v)",
              description: "Додати елемент v вкінець",
            },
            {
              id: 3,
              method: "pop()",
              description: "Видалити останній елемент",
            },
            {
              id: 4,
              method: "insert(i, v)",
              description: "Додати елемент v по індексу i",
            },
            {
              id: 5,
              method: "remove(i)",
              description: "Видалити елемент з індексом i",
            },
            {
              id: 6,
              method: "update(i, v)",
              description:
                "Оновити значення елемента з індексом i на значення v",
            },
            {
              id: 7,
              method: "get(i)",
              description: "Отримати елемент з інлексом i",
            },
            {
              id: 8,
              method: "swap(i1, i2)",
              description: "Поміняти місцями елементи з індексами i1 та i2",
            },
            {
              id: 9,
              method: "reverse()",
              description: "Відзеркалити дані списку",
            },
            {
              id: 10,
              method: "clean()",
              description: "Очистити список від усіх даних",
            },
            {
              id: 11,
              method: "isEmpty()",
              description: "Чи є список порожнім",
            },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у списку елемент i",
            },
            {
              id: 1,
              method: "findIndex(v)",
              description: "Повертає індекс елемента v",
            },
            {
              id: 2,
              method: "linearSearch(v)",
              description:
                "Проходиться по кожному елементу списку, доки не знайде елемент v",
            },
          ],
        },
        {
          id: 2,
          block: "Сорутвання",
          methods: [
            {
              id: 0,
              method: "bubleSort(d)",
              description:
                "Перевіряє два сусідних елементи, починаючи з перших, і міняє їх місями, міняючи їх посилання місцями, якщо вони розташовані у непарвильному поярдку, перевіряючи так всі сусідні пари до кінця списку. Процес повторюється для решти списку без урахування відсортованих елементів. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 1,
              method: "insertionSort(d)",
              description:
                "Перший елемент списку вважається вже відсортованим за замовчуванням. Береться наступний елемент і порівнюється з відсортованими елементами зліва. Елемент вставляється на правильне місце, міняючи своє посилання на елемент справа, а посилання попереднього елемента на цей елемент. Процес повторюється для всіх елементів списку, доки список не відсортується повністю. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 2,
              method: "mergeSort(d)",
              description:
                "Розбиває список на менші частини, доки не залишиться лише списки з одним елементом. Списки з одним елементами зливаються, утворюючи відсортовані списки з більшою кількістю елементів, міняючи свої посилання. Процес повторюється до тих пір, доки не отримаємо один повністю відсортований список. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
          ],
        },
      ],
    },
    "doubly-circular": {
      properties: [
        {
          id: 0,
          property: "head",
          description: "Вказівник на найперший елемент списку",
        },
        {
          id: 1,
          property: "tail",
          description: "Вказівник на останній елемент списку",
        },
        {
          id: 2,
          property: "isDoubly",
          description: "Чи є елемент двонапрямленим",
        },
        {
          id: 3,
          property: "isCircular",
          description: "Чи є елемент циклічним",
        },
      ],
      nodeProps: [
        { id: 0, nodeProp: "value", description: "Значення вузла" },
        {
          id: 1,
          nodeProp: "next",
          description: "Посилання на наступний вузол",
        },
        {
          id: 2,
          nodeProp: "prev",
          description: "Посилання на попередній вузол",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "prepend(v)",
              description: "Додати елемент v напочаток",
            },
            {
              id: 1,
              method: "shift()",
              description: "Видалити перший елемент",
            },
            {
              id: 2,
              method: "apend(v)",
              description: "Додати елемент v вкінець",
            },
            {
              id: 3,
              method: "pop()",
              description: "Видалити останній елемент",
            },
            {
              id: 4,
              method: "insert(i, v)",
              description: "Додати елемент v по індексу i",
            },
            {
              id: 5,
              method: "remove(i)",
              description: "Видалити елемент з індексом i",
            },
            {
              id: 6,
              method: "update(i, v)",
              description:
                "Оновити значення елемента з індексом i на значення v",
            },
            {
              id: 7,
              method: "get(i)",
              description: "Отримати елемент з інлексом i",
            },
            {
              id: 8,
              method: "swap(i1, i2)",
              description: "Поміняти місцями елементи з індексами i1 та i2",
            },
            {
              id: 9,
              method: "reverse()",
              description: "Відзеркалити дані списку",
            },
            {
              id: 10,
              method: "clean()",
              description: "Очистити список від усіх даних",
            },
            {
              id: 11,
              method: "isEmpty()",
              description: "Чи є список порожнім",
            },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у списку елемент i",
            },
            {
              id: 1,
              method: "findIndex(v)",
              description: "Повертає індекс елемента v",
            },
            {
              id: 2,
              method: "linearSearch(v)",
              description:
                "Проходиться по кожному елементу списку, доки не знайде елемент v",
            },
          ],
        },
        {
          id: 2,
          block: "Сорутвання",
          methods: [
            {
              id: 0,
              method: "bubleSort(d)",
              description:
                "Перевіряє два сусідних елементи, починаючи з перших, і міняє їх місями, міняючи їх посилання місцями, якщо вони розташовані у непарвильному поярдку, перевіряючи так всі сусідні пари до кінця списку. Процес повторюється для решти списку без урахування відсортованих елементів. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 1,
              method: "insertionSort(d)",
              description:
                "Перший елемент списку вважається вже відсортованим за замовчуванням. Береться наступний елемент і порівнюється з відсортованими елементами зліва. Елемент вставляється на правильне місце, міняючи свої посилання на елементи зліва та справа, а посилання елементів зліва та справа на цей елемент. Процес повторюється для всіх елементів списку, доки список не відсортується повністю. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
            {
              id: 2,
              method: "mergeSort(d)",
              description:
                "Розбиває список на менші частини, доки не залишиться лише списки з одним елементом. Списки з одним елементами зливаються, утворюючи відсортовані списки з більшою кількістю елементів, міняючи свої посилання. Процес повторюється до тих пір, доки не отримаємо один повністю відсортований список. Параметр d відповідає за порядок сортування (зростання або спадання)",
            },
          ],
        },
      ],
    },
  },
};

const stackConfig: structureConfig<"Stack"> = {
  type: "Stack",
  imgURL: stackImg,
  description: (
    <div>
      <h2>Стек</h2>
      <p>
        Стек - це структура, що зберігає впорядковану послідовність елементів
        одного типу.
      </p>
      <p>
        Стек працює за принципом Last In, First Out (LIFO) - «останнім прийшов,
        першим вийшов». Тобто, нові елементи додаються на вершину стека, а
        видалення відбувається лише з вершини.
      </p>
      <p>
        Для доступу до елемента, що знаходиться глибше у стеку, необхідно
        послідовно видалити всі елементи, розташовані над ним.
      </p>
      <p>Стек може бути реалізований на основі масиву або зв'язаного списку.</p>
    </div>
  ),
  settings: <div>Settings</div>,
  subType: {
    "array-stack": {
      properties: [
        { id: 0, property: "arr", description: "Масив з даними стеку" },
        {
          id: 1,
          property: "topIndex",
          description: "Індекс найверхнього елементу стеку",
        },
        {
          id: 2,
          property: "maxSize",
          description: "Максимальна кількість масиву даних стеку",
        },
        {
          id: 3,
          property: "currentSize",
          description: "Поточна кількість масиву даних стеку",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "push(v)",
              description: "Додати елемент v наверх стеку",
            },
            { id: 1, method: "pop()", description: "Видалити верхній елемент" },
            {
              id: 2,
              method: "update(i, v)",
              description:
                "Оновити значення елемента з індексом i на значення v",
            },
            {
              id: 3,
              method: "peek()",
              description: "Отримати найверхній елемент",
            },
            { id: 4, method: "isEmpty()", description: "Чи є стек порожнім" },
            { id: 5, method: "isFull()", description: "Чи є стек повним" },
            { id: 6, method: "reverse()", description: "Відзеркалити дані " },
            {
              id: 7,
              method: "resize(v)",
              description: "Змінити максимальний розмір стеку",
            },
            {
              id: 8,
              method: "clean()",
              description: "Очистити стек від усіх даних",
            },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у стеку елемент v",
            },
            {
              id: 1,
              method: "findIndex(v)",
              description: "Повертає індекс елемента v",
            },
          ],
        },
      ],
    },
    "list-stack": {
      properties: [
        { id: 0, property: "list", description: "Список з даними списку" },
        {
          id: 1,
          property: "topIndex",
          description: "Індекс найверхнього елементу стеку",
        },
        {
          id: 2,
          property: "currentSize",
          description: "Поточна кількість списку даних стеку",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "push(v)",
              description: "Додати елемент v наверх стеку",
            },
            { id: 1, method: "pop()", description: "Видалити верхній елемент" },
            {
              id: 2,
              method: "update(i, v)",
              description:
                "Оновити значення елемента з індексом i на значення v",
            },
            {
              id: 3,
              method: "peek()",
              description: "Отримати найверхній елемент",
            },
            { id: 4, method: "isEmpty()", description: "Чи є стек порожнім" },
            { id: 5, method: "reverse()", description: "Відзеркалити дані " },
            {
              id: 6,
              method: "clean()",
              description: "Очистити стек від усіх даних",
            },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у стеку елемент v",
            },
            {
              id: 1,
              method: "findIndex(v)",
              description: "Повертає індекс елемента v",
            },
          ],
        },
      ],
    },
  },
};

const queueConfig: structureConfig<"Queue"> = {
  type: "Queue",
  imgURL: queueImg,
  description: (
    <div>
      <h2>Черга</h2>
      <p>
        Черга - це структура, що зберігає впорядковану послідовність елементів
        одного типу.
      </p>
      <p>
        Черга працює за принципом First In, First Out (FIFO) - «першим прийшов,
        першим вийшов», тобто нові елементи додаються в кінець черги, а
        видаляються з її початку.
      </p>
      <p>
        Для доступу до елемента, що знаходиться всередині черги, необхідно
        послідовно видалити всі елементи перед ним.
      </p>
      <p>Черги бувають простими та циклічними.</p>
      <p>
        У циклічній черзі після досягнення кінця виділеної області пам'яті нові
        елементи можуть додаватися на початок, якщо там є вільне місце.
      </p>
    </div>
  ),
  settings: <div>Settings</div>,
  subType: {
    simple: {
      properties: [
        { id: 0, property: "data", description: "Дані черги" },
        {
          id: 1,
          property: "frontIndex",
          description: "Індекс першого елементу черги",
        },
        {
          id: 2,
          property: "rearIndex",
          description: "Індекс останнього елементу черги",
        },
        {
          id: 3,
          property: "maxSize",
          description: "Максимальна кількість даних черги",
        },
        {
          id: 4,
          property: "currentSize",
          description: "Поточна кількість даних черги",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "enqueue(v)",
              description: "Додати новий елемент напочаток черги",
            },
            {
              id: 1,
              method: "dequeue()",
              description: "Видалити елемент з кінця черги",
            },
            {
              id: 2,
              method: "update(i, v)",
              description:
                "Оновити значення елемента з індексом i на значення v",
            },
            {
              id: 3,
              method: "front()",
              description: "Отримати найперший елемент",
            },
            {
              id: 4,
              method: "back()",
              description: "Отримати останній елемент",
            },
            {
              id: 5,
              method: "reverse()",
              description: "Відзеркати дані черги",
            },
            { id: 6, method: "isEmpty()", description: "Чи є черга порожньою" },
            { id: 7, method: "isFull()", description: "Чи є черга повною" },
            {
              id: 8,
              method: "clean()",
              description: "Очистити черга від усіх даних",
            },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у черга елемент v",
            },
            {
              id: 1,
              method: "findIndex(v)",
              description: "Повертає індекс елемента v",
            },
            {
              id: 2,
              method: "linearSearch(v)",
              description:
                "Проходиться по кожному елементу черги, доки не знайде елемент v",
            },
          ],
        },
      ],
    },
    circular: {
      properties: [
        { id: 0, property: "data", description: "Дані черги" },
        {
          id: 1,
          property: "frontIndex",
          description: "Індекс першого елементу черги",
        },
        {
          id: 2,
          property: "rearIndex",
          description: "Індекс останнього елементу черги",
        },
        {
          id: 3,
          property: "maxSize",
          description: "Максимальна кількість даних черги",
        },
        {
          id: 4,
          property: "currentSize",
          description: "Поточна кількість даних черги",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "enqueue(v)",
              description: "Додати новий елемент напочаток черги",
            },
            {
              id: 1,
              method: "dequeue()",
              description: "Видалити елемент з кінця черги",
            },
            {
              id: 2,
              method: "update(i, v)",
              description:
                "Оновити значення елемента з індексом i на значення v",
            },
            {
              id: 3,
              method: "front()",
              description: "Отримати найперший елемент",
            },
            {
              id: 4,
              method: "back()",
              description: "Отримати останній елемент",
            },
            {
              id: 5,
              method: "reverse()",
              description: "Відзеркати дані черги",
            },
            { id: 6, method: "isEmpty()", description: "Чи є черга порожньою" },
            { id: 7, method: "isFull()", description: "Чи є черга повною" },
            {
              id: 8,
              method: "clean()",
              description: "Очистити черга від усіх даних",
            },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у черзі елемент v",
            },
            {
              id: 1,
              method: "findIndex(v)",
              description: "Повертає індекс елемента v",
            },
            {
              id: 2,
              method: "linearSearch(v)",
              description:
                "Проходиться по кожному елементу черзі, доки не знайде елемент v",
            },
          ],
        },
      ],
    },
  },
};

const treeConfig: structureConfig<"Tree"> = {
  type: "Tree",
  imgURL: treeImg,
  description: (
    <div>
      <h2>Дерево</h2>
      <p>
        Дерево - це ієрархічна структура даних, що складається з пов'язаних між
        собою елементів (вузвів).
      </p>
      <p>Основні елементи дерева:</p>
      <ul>
        <li>
          Конінь (Root) - це верхній вузол дерева, з якого все починається і
          який не має батьківського вузла.
        </li>
        <li>
          Батьківський вузол (Parent) - це вузол, який має розгалуження до інших
          вузлів.
        </li>
        <li>Нащадок (Child) - це вузол, що відходить від батьківського.</li>
        <li>
          Лист (Leaf) - це вузол, який не має нащадків (знаходиться в самому
          кінці гілки).
        </li>
      </ul>
      <p>
        Кожен вузол, окрім кореня, є нащадком іншого вузла. Водночас вузол може
        бути батьківським для своїх нащадків.
      </p>
      <p>Існують такі види дерев:</p>
      <dl>
        <dt>
          <h3>Довільні дерева</h3>
        </dt>
        <dd>
          У довільних деревах немає збалансованості, немає правил розміщення
          вузлів, а також вузли мають будь-яку кількість нащадків.
        </dd>
        <br />
        <dt>
          <h3>Бінарні дерева</h3>
        </dt>
        <dd>У бінарних деревах вузли можуть мати не більше двох нащадків.</dd>
        <br />
        <dt>
          <h3>Бінарні дерева пошуку</h3>
        </dt>
        <dd>
          <p>
            У бінарних деревах пошуку кожен вузол може мати не більше двох
            нащадків: лівий та правий.
          </p>
          <p>
            Значення лівого піддерева менші за значення вузла. Значення правого
            піддерева більші за значення вузла.
          </p>
        </dd>
        <br />
        <dt>
          <h3>AVL-дерева</h3>
        </dt>
        <dd>
          AVL-дерево - це самобалансоване дерево бінарного пошуку. Для кожного
          вузла різниця висот лівого та правого піддерев не перевищує 1. Якщо
          баланс порушується, виконуються спеціальні обертання (ліві або праві)
          для його відновлення.
        </dd>
        <br />
        <dt>
          <h3>2-3 дерева</h3>
        </dt>
        <dd>
          2-3 дерево - це самобалансоване дерево пошуку, у якому кожен вузол
          містить одне або два значення та має відповідно дві або три дочірні
          гілки. Усі листові вузли знаходяться на однаковій відстані від кореня.
        </dd>
        <br />
        <dt>
          <h3>Червоно-чорні дерева</h3>
        </dt>
        <dd>
          Червоно-чорне дерево - це самобалансоване дерево бінарного пошуку, у
          якому:
          <ul>
            <li>вузол має червоний або чорний колір</li>
            <li>корінь завжди чорний</li>
            <li>усі null-листи чорні</li>
            <li>червоний вузол не може мати червоних нащадків</li>
            <li>
              будь-якому шляху від корення до null-листків містить однакову
              кількість чорних вершин
            </li>
            <li>кожний новий вузол додається як червоний</li>
          </ul>
        </dd>
      </dl>
    </div>
  ),
  settings: <div>Settings</div>,
  subType: {
    arbitrary: {
      properties: [
        { id: 0, property: "id", description: "Унікальний номер дерева" },
        { id: 1, property: "root", description: "Коріневий вузол" },
        { id: 2, property: "size", description: "Кількість вузлів" },
        { id: 3, property: "height", description: "Висота дерева" },
      ],
      nodeProps: [
        { id: 0, nodeProp: "value", description: "Значення вузла" },
        { id: 1, nodeProp: "parent", description: "Батьківський вузол" },
        { id: 2, nodeProp: "children", description: "Масив дочірніх вузлів" },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "addNode(v)",
              description: "Додати новий вузол v",
            },
            {
              id: 1,
              method: "delNode(n)",
              description: "Видалити вузол n",
            },
            {
              id: 2,
              method: "updateNode(n, v)",
              description: "Оновити значення вузла n на значення v",
            },
            {
              id: 3,
              method: "clean()",
              description: "Очистити всі вузли у дереві",
            },
            {
              id: 4,
              method: "getHeight()",
              description: "Отримати висоту дерева",
            },
            {
              id: 5,
              method: "getDepth(n)",
              description: "Отримати глубину вузла n",
            },
            {
              id: 6,
              method: "getSize()",
              description: "Отримати кількість вузлів дерева",
            },
            {
              id: 7,
              method: "isEmpty()",
              description: "Чи є дерево порожнім",
            },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у дереві вузол зі значенням v",
            },
            {
              id: 1,
              method: "findNode(v)",
              description:
                "Перевіряє значення кореневого дерева із шуканим значенням v. Якщо значення співпадають, то пошук завершено. Якщо значення v менше, то йдемо у лівий дочірній вузол і перевіряємо там. Якщо значення v быльше, то йдемо у привий дочірній елемент і перевіряємо там. Процес повторюється рекурсивно до тих пір, доки шукне значення не буде знайдено або доки не дійдемо до листка",
            },
            {
              id: 2,
              method: "findMin()",
              description: "Шукає мінімальне значення",
            },
            {
              id: 3,
              method: "findMax()",
              description: "Шукає максимальне значення",
            },
            {
              id: 4,
              method: "DFS(v)",
              description: "Пошук вузла зі значенням v у глибину",
            },
            {
              id: 5,
              method: "BFS(v)",
              description: "Пошук вузла зі значенням v у ширину",
            },
          ],
        },
      ],
    },
    binary: {
      properties: [
        { id: 0, property: "id", description: "Унікальний номер дерева" },
        { id: 1, property: "root", description: "Коріневий вузол" },
        { id: 2, property: "size", description: "Кількість вузлів" },
        { id: 3, property: "height", description: "Висота дерева" },
      ],
      nodeProps: [
        { id: 0, nodeProp: "value", description: "Значення вузла" },
        { id: 1, nodeProp: "parent", description: "Батьківський вузол" },
        { id: 2, nodeProp: "left", description: "Лівий дочірній вузлол" },
        {
          id: 4,
          nodeProp: "right",
          description: "Правий дочірній вузлол",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "addNode(v)",
              description: "Додати новий вузол v",
            },
            {
              id: 1,
              method: "delNode(n)",
              description: "Видалити вузол n",
            },
            {
              id: 2,
              method: "updateNode(n, v)",
              description: "Оновити значення вузла n на значення v",
            },
            {
              id: 3,
              method: "clean()",
              description: "Очистити всі вузли у дереві",
            },
            {
              id: 4,
              method: "getHeight()",
              description: "Отримати висоту дерева",
            },
            {
              id: 5,
              method: "getDepth(n)",
              description: "Отримати глубину вузла n",
            },
            {
              id: 6,
              method: "getSize()",
              description: "Отримати кількість вузлів дерева",
            },
            {
              id: 7,
              method: "isEmpty()",
              description: "Чи є дерево порожнім",
            },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у дереві вузол зі значенням v",
            },
            {
              id: 1,
              method: "findNode(v)",
              description:
                "Перевіряє значення кореневого дерева із шуканим значенням v. Якщо значення співпадають, то пошук завершено. Якщо значення v менше, то йдемо у лівий дочірній вузол і перевіряємо там. Якщо значення v быльше, то йдемо у привий дочірній елемент і перевіряємо там. Процес повторюється рекурсивно до тих пір, доки шукне значення не буде знайдено або доки не дійдемо до листка",
            },
            {
              id: 2,
              method: "findMin()",
              description: "Шукає мінімальне значення",
            },
            {
              id: 3,
              method: "findMax()",
              description: "Шукає максимальне значення",
            },
            {
              id: 4,
              method: "DFS(v)",
              description: "Пошук вузла зі значенням v у глибину",
            },
            {
              id: 5,
              method: "BFS(v)",
              description: "Пошук вузла зі значенням v у ширину",
            },
          ],
        },
      ],
    },
    binarySearch: {
      properties: [
        { id: 0, property: "id", description: "Унікальний номер дерева" },
        { id: 1, property: "root", description: "Коріневий вузол" },
        { id: 2, property: "size", description: "Кількість вузлів" },
        { id: 3, property: "height", description: "Висота дерева" },
      ],
      nodeProps: [
        { id: 0, nodeProp: "value", description: "Значення вузла" },
        { id: 1, nodeProp: "parent", description: "Батьківський вузол" },
        { id: 2, nodeProp: "left", description: "Лівий дочірній вузлол" },
        {
          id: 3,
          nodeProp: "right",
          description: "Правий дочірній вузлол",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "addNode(v)",
              description: "Додати новий вузол v",
            },
            {
              id: 1,
              method: "delNode(n)",
              description: "Видалити вузол n",
            },
            {
              id: 2,
              method: "updateNode(n, v)",
              description: "Оновити значення вузла n на значення v",
            },
            {
              id: 3,
              method: "clean()",
              description: "Очистити всі вузли у дереві",
            },
            {
              id: 4,
              method: "getHeight()",
              description: "Отримати висоту дерева",
            },
            {
              id: 5,
              method: "getDepth(n)",
              description: "Отримати глубину вузла n",
            },
            {
              id: 6,
              method: "getSize()",
              description: "Отримати кількість вузлів дерева",
            },
            {
              id: 7,
              method: "isEmpty()",
              description: "Чи є дерево порожнім",
            },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у дереві вузол зі значенням v",
            },
            {
              id: 1,
              method: "findNode(v)",
              description:
                "Перевіряє значення кореневого дерева із шуканим значенням v. Якщо значення співпадають, то пошук завершено. Якщо значення v менше, то йдемо у лівий дочірній вузол і перевіряємо там. Якщо значення v быльше, то йдемо у привий дочірній елемент і перевіряємо там. Процес повторюється рекурсивно до тих пір, доки шукне значення не буде знайдено або доки не дійдемо до листка",
            },
            {
              id: 2,
              method: "findMin()",
              description: "Шукає мінімальне значення",
            },
            {
              id: 3,
              method: "findMax()",
              description: "Шукає максимальне значення",
            },
            {
              id: 4,
              method: "DFS(v)",
              description: "Пошук вузла зі значенням v у глибину",
            },
            {
              id: 5,
              method: "BFS(v)",
              description: "Пошук вузла зі значенням v у ширину",
            },
          ],
        },
      ],
    },
    AVL: {
      properties: [
        { id: 0, property: "id", description: "Унікальний номер дерева" },
        { id: 1, property: "root", description: "Коріневий вузол" },
        { id: 2, property: "size", description: "Кількість вузлів" },
        { id: 3, property: "height", description: "Висота дерева" },
      ],
      nodeProps: [
        { id: 0, nodeProp: "value", description: "Значення вузла" },
        { id: 1, nodeProp: "parent", description: "Батьквський вузол" },
        { id: 2, nodeProp: "left", description: "Лівий дочірній вузлол" },
        {
          id: 3,
          nodeProp: "right",
          description: "Правий дочірній вузлол",
        },
        { id: 4, nodeProp: "height", description: "Висота піддерева" },
        {
          id: 5,
          nodeProp: "balanceFactor",
          description: "Фактор збалансованості",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "addNode(v)",
              description: "Додати новий вузол v",
            },
            {
              id: 1,
              method: "delNode(n)",
              description: "Видалити вузол n",
            },
            {
              id: 2,
              method: "updateNode(n, v)",
              description: "Оновити значення вузла n на значення v",
            },
            {
              id: 3,
              method: "clean()",
              description: "Очистити всі вузли у дереві",
            },
            {
              id: 4,
              method: "getHeight()",
              description: "Отримати висоту дерева",
            },
            {
              id: 5,
              method: "getDepth(n)",
              description: "Отримати глубину вузла n",
            },
            {
              id: 6,
              method: "getSize()",
              description: "Отримати кількість вузлів дерева",
            },
            {
              id: 7,
              method: "isEmpty()",
              description: "Чи є дерево порожнім",
            },
            {
              id: 8,
              method: "isBalanced(n)",
              description: "Чи є дерево збалансованим",
            },
          ],
        },
        {
          id: 1,
          block: "Балансування",
          methods: [
            {
              id: 0,
              method: "getBalance(n)",
              description: "Повертає коефіцієнт балансу вузла n",
            },
            {
              id: 1,
              method: "updateHeight(n)",
              description:
                "Оновлює висоту вузла n на основі висоти його дочірніх вузлів",
            },
            {
              id: 2,
              method: "updateBalance(n)",
              description: "Оновлює фактор збалансованості вузла n",
            },
            {
              id: 3,
              method: "rebalance(n)",
              description:
                "Перевіряє, чи порушено баланс вузла(balanceFactor < -1 або > 1), n і виконує відповідний поворот для відновлення балансу дерева",
            },
            {
              id: 4,
              method: "rotateLeft(n)",
              description: "Виконує лівий поворот навколо вузла n",
            },
            {
              id: 5,
              method: "rotateRight(n)",
              description: "Виконує парвий поворот навколо вузла n",
            },
            {
              id: 6,
              method: "rotateLeftRight(n)",
              description:
                "Виконує подвійний поворот: спочатку лівий, потім правий навколо вузла n",
            },
            {
              id: 7,
              method: "rotateRightLeft(n)",
              description:
                "Виконує подвійний поворот: спочатку правий, потім лівий навколо вузла n",
            },
          ],
        },
        {
          id: 2,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у дереві вузол зі значенням v",
            },
            {
              id: 1,
              method: "findNode(v)",
              description:
                "Перевіряє значення кореневого дерева із шуканим значенням v. Якщо значення співпадають, то пошук завершено. Якщо значення v менше, то йдемо у лівий дочірній вузол і перевіряємо там. Якщо значення v быльше, то йдемо у привий дочірній елемент і перевіряємо там. Процес повторюється рекурсивно до тих пір, доки шукне значення не буде знайдено або доки не дійдемо до листка",
            },
            {
              id: 2,
              method: "findMin()",
              description: "Шукає мінімальне значення",
            },
            {
              id: 3,
              method: "findMax()",
              description: "Шукає максимальне значення",
            },
            {
              id: 4,
              method: "DFS(v)",
              description: "Пошук вузла зі значенням v у глибину",
            },
            {
              id: 5,
              method: "BFS(v)",
              description: "Пошук вузла зі значенням v у ширину",
            },
          ],
        },
      ],
    },
    "2-3": {
      properties: [
        { id: 0, property: "id", description: "Унікальний номер дерева" },
        { id: 1, property: "root", description: "Коріневий вузол" },
        { id: 2, property: "size", description: "Кількість вузлів" },
        { id: 3, property: "height", description: "Висота дерева" },
      ],
      nodeProps: [
        { id: 0, nodeProp: "keys", description: "Масив ключів вузла" },
        { id: 1, nodeProp: "children", description: "Масив дочірнчх вузлів" },
        { id: 2, nodeProp: "parent", description: "Бітьківський вузол" },
        { id: 3, nodeProp: "isLeaf", description: "Чи є вузол листком" },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "addNode(v)",
              description: "Додати новий вузол v",
            },
            {
              id: 1,
              method: "delNode(n)",
              description: "Видалити вузол n",
            },
            {
              id: 2,
              method: "updateNode(n, v)",
              description: "Оновити значення вузла n на значення v",
            },
            {
              id: 3,
              method: "clean()",
              description: "Очистити всі вузли у дереві",
            },
            {
              id: 4,
              method: "getHeight()",
              description: "Отримати висоту дерева",
            },
            {
              id: 5,
              method: "getDepth(n)",
              description: "Отримати глубину вузла n",
            },
            {
              id: 6,
              method: "getSize()",
              description: "Отримати кількість вузлів дерева",
            },
            {
              id: 7,
              method: "isEmpty()",
              description: "Чи є дерево порожнім",
            },
            {
              id: 8,
              method: "split(n)",
              description:
                "Розщеплює один переповнений 3-вузол у два нових 2-вузли",
            },
            { id: 9, method: "merge(n)", description: "Об'єднує два вузли" },
            {
              id: 10,
              method: "borrow()",
              description: "Позичаэ ключ у сусіда",
            },
            { id: 11, method: "fixInsertion(n)", description: "" },
            { id: 12, method: "fixDeletion(n)", description: "" },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у дереві вузол зі значенням v",
            },
            {
              id: 1,
              method: "findNode(v)",
              description:
                "Перевіряє значення кореневого дерева із шуканим значенням v. Якщо значення співпадають, то пошук завершено. Якщо значення v менше, то йдемо у лівий дочірній вузол і перевіряємо там. Якщо значення v быльше, то йдемо у привий дочірній елемент і перевіряємо там. Процес повторюється рекурсивно до тих пір, доки шукне значення не буде знайдено або доки не дійдемо до листка",
            },
            {
              id: 2,
              method: "findMin()",
              description: "Шукає мінімальне значення",
            },
            {
              id: 3,
              method: "findMax()",
              description: "Шукає максимальне значення",
            },
            {
              id: 4,
              method: "DFS(v)",
              description: "Пошук вузла зі значенням v у глибину",
            },
            {
              id: 5,
              method: "BFS(v)",
              description: "Пошук вузла зі значенням v у ширину",
            },
          ],
        },
      ],
    },
    "Red-Black": {
      properties: [
        { id: 0, property: "id", description: "Унікальний номер дерева" },
        { id: 1, property: "root", description: "Коріневий вузол" },
        { id: 2, property: "size", description: "Кількість вузлів" },
        { id: 3, property: "height", description: "Висота дерева" },
      ],
      nodeProps: [
        { id: 0, nodeProp: "parent", description: "Батьківський вузол" },
        { id: 1, nodeProp: "value", description: "Значення вузла" },
        { id: 2, nodeProp: "color", description: "Колір вузла" },
        { id: 3, nodeProp: "left", description: "Лівий дочірній вузол" },
        { id: 4, nodeProp: "right", description: "Правий дочірній вузол" },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "addNode(v)",
              description: "Додати новий вузол v",
            },
            {
              id: 1,
              method: "delNode(n)",
              description: "Видалити вузол n",
            },
            {
              id: 2,
              method: "updateNode(n, v)",
              description: "Оновити значення вузла n на значення v",
            },
            {
              id: 3,
              method: "recolor(n)",
              description: "Змінює колір вузла n",
            },
            {
              id: 4,
              method: "clean()",
              description: "Очистити всі вузли у дереві",
            },
            {
              id: 5,
              method: "getHeight()",
              description: "Отримати висоту дерева",
            },
            {
              id: 6,
              method: "getDepth(n)",
              description: "Отримати глубину вузла n",
            },
            {
              id: 7,
              method: "getSize()",
              description: "Отримати кількість вузлів дерева",
            },
            {
              id: 8,
              method: "isEmpty()",
              description: "Чи є дерево порожнім",
            },
          ],
        },
        {
          id: 1,
          block: "Балансування",
          methods: [
            {
              id: 0,
              method: "fixInsertion()",
              description:
                "Відновлює властивості Red-Black дерева після вставки нового вузла. За потреби виконує перефарбовування вузлів і повороти дерева",
            },
            {
              id: 1,
              method: "fixDeletion()",
              description:
                "Відновлює властивості Red-Black дерева після видалення вузла. За потреби виконує перефарбовування вузлів і повороти дерева",
            },
            {
              id: 2,
              method: "rotateLeft(n)",
              description: "Виконує лівий поворот навколо вказаного вузла",
            },
            {
              id: 3,
              method: "rotateRight(n)",
              description: "Виконує правий поворот навколо вказаного вузла",
            },
          ],
        },
        {
          id: 2,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "contains(v)",
              description: "Перевіряє, чи є у дереві вузол зі значенням v",
            },
            {
              id: 1,
              method: "findNode(v)",
              description:
                "Перевіряє значення кореневого дерева із шуканим значенням v. Якщо значення співпадають, то пошук завершено. Якщо значення v менше, то йдемо у лівий дочірній вузол і перевіряємо там. Якщо значення v быльше, то йдемо у привий дочірній елемент і перевіряємо там. Процес повторюється рекурсивно до тих пір, доки шукне значення не буде знайдено або доки не дійдемо до листка",
            },
            {
              id: 2,
              method: "findMin()",
              description: "Шукає мінімальне значення",
            },
            {
              id: 3,
              method: "findMax()",
              description: "Шукає максимальне значення",
            },
            {
              id: 4,
              method: "DFS(v)",
              description: "Пошук вузла зі значенням v у глибину",
            },
            {
              id: 5,
              method: "BFS(v)",
              description: "Пошук вузла зі значенням v у ширину",
            },
          ],
        },
      ],
    },
  },
};

const graphConfig: structureConfig<"Graph"> = {
  type: "Graph",
  imgURL: graphImg,
  description: (
    <div>
      <h2>Граф</h2>
      <p>
        Граф - це нелінійна структура даних, що складається з вершин (Vertex /
        Node) та ребер (Edge / Link), які і з'єднують ці вершини.
      </p>
      <p>Граф може бути:</p>
      <ul>
        <li>орієнтований та нееорієнтований</li>
        <li>зважений та незважений</li>
      </ul>
      <dl>
        <dt>
          <h3>Орієнтований граф</h3>
        </dt>
        <dd>Зв'язки мають напрямок (односторонній).</dd>
        <dt>
          <h3>Неорієнтований граф</h3>
        </dt>
        <dd>Зв'язки не мають напрямку (двосторонні).</dd>
        <dt>
          <h3>Зважений граф</h3>
        </dt>
        <dd>Кожне ребро якого має певне числове значення (вагу).</dd>
        <dt>
          <h3>Незважений граф</h3>
        </dt>
        <dd>
          Ребра вказують лише на наявність зв'язку, без додаткових числових
          характеристик.
        </dd>
      </dl>
    </div>
  ),
  settings: <div>Settings</div>,
  subType: {
    "unweighted-undirected": {
      properties: [
        { id: 0, property: "id", description: "Унікальний номер графа" },
        { id: 1, property: "vertexes", description: "Масив вершин" },
        {
          id: 2,
          property: "adjacencyMatrix",
          description: "Матриця суміжності",
        },
        { id: 3, property: "isDirected", description: "Чи є граф напрямленим" },
        { id: 4, property: "isWeighted", description: "Чи є граф зваженим" },
      ],
      nodeProps: [
        { id: 0, nodeProp: "id", description: "Унікальний номер" },
        { id: 1, nodeProp: "value", description: "Значення вершини" },
        { id: 2, nodeProp: "neighbours", description: "Масив сусідів" },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "addVertex(v)",
              description: "Додає вершину зі значнням v",
            },
            { id: 1, method: "delVertex(n)", description: "Видаляє вершину n" },
            {
              id: 2,
              method: "updateVertex(n, v)",
              description: "Оновляє значення вершини n на значення v",
            },
            { id: 3, method: "getVertex(n)", description: "Отримує вершину n" },
            {
              id: 4,
              method: "getVertex(n)",
              description: "Повертає вузол n",
            },
            {
              id: 5,
              method: "hasVertex(v)",
              description: "Перевіряє, чи є у графі вершина v",
            },
            {
              id: 6,
              method: "addEdge(n1, n2)",
              description: "Додає ребро між вузлами n1 та n2",
            },
            {
              id: 7,
              method: "delEdge(n1, n2)",
              description: "Видаляє ребро між вузлами n1 та n2",
            },
            {
              id: 8,
              method: "hasEdge(n1, n2)",
              description: "Чи існує ребро між вузлами n1 та n2",
            },
            {
              id: 9,
              method: "isEmpty()",
              description: "Чи є граф порожнім",
            },
            {
              id: 10,
              method: "getDegree(n)",
              description: "Повертає степінь вузла n",
            },
            {
              id: 11,
              method: "hasCycle(n)",
              description: "Перевіряє, чи є цикл у вузла n",
            },
            { id: 12, method: "clean()", description: "Очищає граф" },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "findVertex(v)",
              description: "Шукає вершину зі значенням v",
            },
            {
              id: 1,
              method: "findEdge(n1, n2)",
              description: "Шукає ребро міє вершинами n1 та n2",
            },
            { id: 2, method: "DFS(v)", description: "Пошук вузла v у глубину" },
            { id: 3, method: "BFS(v)", description: "Пошук вузла v у ширину" },
          ],
        },
        {
          id: 2,
          block: "Алгоритми шляхів",
          methods: [
            {
              id: 0,
              method: "hasPath(n1, n2)",
              description: "Повертає, чи існує шлях між вершинами n1 та n2",
            },
          ],
        },
      ],
    },
    "unweighted-directed": {
      properties: [
        { id: 0, property: "id", description: "Унікальний номер графа" },
        { id: 1, property: "vertexes", description: "Масив вершин" },
        {
          id: 2,
          property: "adjacencyMatrix",
          description: "Матриця суміжності",
        },
        { id: 3, property: "isDirected", description: "Чи є граф напрямленим" },
        { id: 4, property: "isWeighted", description: "Чи є граф зваженим" },
      ],
      nodeProps: [
        { id: 0, nodeProp: "id", description: "Унікальний номер" },
        { id: 1, nodeProp: "value", description: "Значення вершини" },
        { id: 2, nodeProp: "outgoing", description: "Масив вихідних сусідів" },
        { id: 3, nodeProp: "incoming", description: "Масив вхідних сусідів" },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "addVertex(v)",
              description: "Додає вершину зі значнням v",
            },
            { id: 1, method: "delVertex(n)", description: "Видаляє вершину n" },
            {
              id: 2,
              method: "updateVertex(n, v)",
              description: "Оновляє значення вершини n на значення v",
            },
            { id: 3, method: "getVertex(n)", description: "Отримує вершину n" },
            {
              id: 4,
              method: "getVertex(n)",
              description: "Повертає вузол n",
            },
            {
              id: 5,
              method: "hasVertex(v)",
              description: "Перевіряє, чи є у графі вершина v",
            },
            {
              id: 6,
              method: "addEdge(n1, n2)",
              description: "Додає ребро між вузлами n1 та n2",
            },
            {
              id: 7,
              method: "delEdge(n1, n2)",
              description: "Видаляє ребро між вузлами n1 та n2",
            },
            {
              id: 8,
              method: "hasEdge(n1, n2)",
              description: "Чи існує ребро між вузлами n1 та n2",
            },
            {
              id: 9,
              method: "isEmpty()",
              description: "Чи є граф порожнім",
            },
            {
              id: 10,
              method: "getDegree(n)",
              description: "Повертає степінь вузла n",
            },
            {
              id: 11,
              method: "hasCycle(n)",
              description: "Перевіряє, чи є цикл у вузла n",
            },
            { id: 12, method: "clean()", description: "Очищає граф" },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "findVertex(v)",
              description: "Шукає вершину зі значенням v",
            },
            {
              id: 1,
              method: "findEdge(n1, n2)",
              description: "Шукає ребро міє вершинами n1 та n2",
            },
            { id: 2, method: "DFS(v)", description: "Пошук вузла v у глубину" },
            { id: 3, method: "BFS(v)", description: "Пошук вузла v у ширину" },
          ],
        },
        {
          id: 2,
          block: "Алгоритми шляхів",
          methods: [
            {
              id: 0,
              method: "hasPath(n1, n2)",
              description: "Повертає, чи існує шлях між вершинами n1 та n2",
            },
          ],
        },
      ],
    },
    "weighted-undirected": {
      properties: [
        { id: 0, property: "id", description: "Унікальний номер графа" },
        { id: 1, property: "vertexes", description: "Масив вершин" },
        {
          id: 2,
          property: "adjacencyMatrix",
          description: "Матриця суміжності",
        },
        { id: 3, property: "isDirected", description: "Чи є граф напрямленим" },
        { id: 4, property: "isWeighted", description: "Чи є граф зваженим" },
      ],
      nodeProps: [
        { id: 0, nodeProp: "id", description: "Унікальний номер" },
        { id: 1, nodeProp: "value", description: "Значення вершини" },
        { id: 2, nodeProp: "neighbours", description: "Масив сусідів" },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "addVertex(v)",
              description: "Додає вершину зі значнням v",
            },
            { id: 1, method: "delVertex(n)", description: "Видаляє вершину n" },
            {
              id: 2,
              method: "updateVertex(n, v)",
              description: "Оновляє значення вершини n на значення v",
            },
            { id: 3, method: "getVertex(n)", description: "Отримує вершину n" },
            {
              id: 4,
              method: "getVertex(n)",
              description: "Повертає вузол n",
            },
            {
              id: 5,
              method: "hasVertex(v)",
              description: "Перевіряє, чи є у графі вершина v",
            },
            {
              id: 6,
              method: "addEdge(n1, n2)",
              description: "Додає ребро між вузлами n1 та n2",
            },
            {
              id: 7,
              method: "delEdge(n1, n2)",
              description: "Видаляє ребро між вузлами n1 та n2",
            },
            {
              id: 8,
              method: "updateEdge(n1, n2)",
              description: "Оновлює ребро між вузлами n1 та n2",
            },
            {
              id: 9,
              method: "getEdge(n1, n2)",
              description: "Повертає ребро між вузлами n1 та n2",
            },
            {
              id: 10,
              method: "hasEdge(n1, n2)",
              description: "Чи існує ребро між вузлами n1 та n2",
            },
            {
              id: 11,
              method: "setWeight(n1, n2, w)",
              description:
                "Встановлює значення ваги w ребру між вузлами n1 та n2",
            },
            {
              id: 12,
              method: "getWeight(n1, n2)",
              description: "Повертає значення ваги ребра між вузлами n1 та n2",
            },
            {
              id: 13,
              method: "isEmpty()",
              description: "Чи є граф порожнім",
            },
            {
              id: 14,
              method: "getDegree(n)",
              description: "Повертає степінь вузла n",
            },
            {
              id: 15,
              method: "hasCycle(n)",
              description: "Перевіряє, чи є цикл у вузла n",
            },
            { id: 16, method: "clean()", description: "Очищає граф" },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "findVertex(v)",
              description: "Шукає вершину зі значенням v",
            },
            {
              id: 1,
              method: "findEdge(n1, n2)",
              description: "Шукає ребро міє вершинами n1 та n2",
            },
            { id: 2, method: "DFS(v)", description: "Пошук вузла v у глубину" },
            { id: 3, method: "BFS(v)", description: "Пошук вузла v у ширину" },
          ],
        },
        {
          id: 2,
          block: "Алгоритми шляхів",
          methods: [
            {
              id: 0,
              method: "hasPath(n1, n2)",
              description: "Повертає, чи існує шлях між вершинами n1 та n2",
            },
            {
              id: 1,
              method: "Dijkstra(n)",
              description:
                "Поступово розширює область від стартової вершини n до всіх інших, завжди обираючи найближчу ще не оброблену вершину. Для стартової вершини відстань встановлюється як 0. Для всіх невідвіданих вершин відстань вважається за нескінченність. Обирається вершина з найменшою відомою відстанню до неї. Алгоритм переглядає всіх сусідів даної вершини. Якщо шлях до сусіда через поточну вершину виявляється коротшим за вже записаний, ця нова відстань записується як мінімальна. Поточна вершина позначається як відвідана і більше не розглядається. Алгоритм повторюється, доки всі вершини не будуть відвідані. Працює тільки з невід'ємними вагами ребер",
            },
            {
              id: 2,
              method: "BellmanFord(n)",
              description:
                "Поступово розширює область від стартової вершини n до всіх інших, навіть якщо є від'ємні ваги, багато разів проходячись по всіх ребрах, щоб покращити знайдені відстані. Для стартової вершини відстань встановлюється як 0. Для всіх невідвіданих вершин відстань вважається за нескінченність. Пройти по всіх ребрах графа. Для кожного ребра перевірити, чи можна покращити (зменшити) відстань до його кінцевої вершини. Якщо можна, то відстань оновлюється і запам'ятовується попередня вершина. Це називаєтсья релаксація. Релаксація повторюється N-1 разів, де N - кількість вершин. Після завершення V − 1 проходів, робиться ще один прохід по всіх ребрах для перевірки на негативні цикли. Якщо відстань до якоїсь вершини все ще може зменшитися, це означає, що в графі є цикл від'ємної ваги, і коректного рішення не існує. Якщо від'ємного циклу немає, то отримані відстані є найкоротшими",
            },
            { id: 3, method: "AStar(n)", description: "" }, //ЧИ ТРЕБА ЙОГО ВЗАГАЛІ РОБИТИ (ЗАНАДТО СКЛАДНИЙ)!!!
          ],
        },
      ],
    },
    "weighted-directed": {
      properties: [
        { id: 0, property: "id", description: "Унікальний номер графа" },
        { id: 1, property: "vertexes", description: "Масив вершин" },
        {
          id: 2,
          property: "adjacencyMatrix",
          description: "Матриця суміжності",
        },
        { id: 3, property: "isDirected", description: "Чи є граф напрямленим" },
        { id: 4, property: "isWeighted", description: "Чи є граф зваженим" },
      ],
      nodeProps: [
        { id: 0, nodeProp: "id", description: "Унікальний номер" },
        { id: 1, nodeProp: "value", description: "Значення вершини" },
        { id: 2, nodeProp: "outgoing", description: "Масив вихідних сусідів" },
        { id: 3, nodeProp: "incoming", description: "Масив вхідних сусідів" },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "addVertex(v)",
              description: "Додає вершину зі значнням v",
            },
            { id: 1, method: "delVertex(n)", description: "Видаляє вершину n" },
            {
              id: 2,
              method: "updateVertex(n, v)",
              description: "Оновляє значення вершини n на значення v",
            },
            { id: 3, method: "getVertex(n)", description: "Отримує вершину n" },
            {
              id: 4,
              method: "getVertex(n)",
              description: "Повертає вузол n",
            },
            {
              id: 5,
              method: "hasVertex(v)",
              description: "Перевіряє, чи є у графі вершина v",
            },
            {
              id: 6,
              method: "addEdge(n1, n2)",
              description: "Додає ребро між вузлами n1 та n2",
            },
            {
              id: 7,
              method: "delEdge(n1, n2)",
              description: "Видаляє ребро між вузлами n1 та n2",
            },
            {
              id: 8,
              method: "updateEdge(n1, n2)",
              description: "Оновлює ребро між вузлами n1 та n2",
            },
            {
              id: 9,
              method: "getEdge(n1, n2)",
              description: "Повертає ребро між вузлами n1 та n2",
            },
            {
              id: 10,
              method: "hasEdge(n1, n2)",
              description: "Чи існує ребро між вузлами n1 та n2",
            },
            {
              id: 11,
              method: "setWeight(n1, n2, w)",
              description:
                "Встановлює значення ваги w ребру між вузлами n1 та n2",
            },
            {
              id: 12,
              method: "getWeight(n1, n2)",
              description: "Повертає значення ваги ребра між вузлами n1 та n2",
            },
            {
              id: 13,
              method: "isEmpty()",
              description: "Чи є граф порожнім",
            },
            {
              id: 14,
              method: "getDegree(n)",
              description: "Повертає степінь вузла n",
            },
            {
              id: 15,
              method: "hasCycle(n)",
              description: "Перевіряє, чи є цикл у вузла n",
            },
            { id: 16, method: "clean()", description: "Очищає граф" },
          ],
        },
        {
          id: 1,
          block: "Пошук",
          methods: [
            {
              id: 0,
              method: "findVertex(v)",
              description: "Шукає вершину зі значенням v",
            },
            {
              id: 1,
              method: "findEdge(n1, n2)",
              description: "Шукає ребро міє вершинами n1 та n2",
            },
            { id: 2, method: "DFS(v)", description: "Пошук вузла v у глубину" },
            { id: 3, method: "BFS(v)", description: "Пошук вузла v у ширину" },
          ],
        },
        {
          id: 2,
          block: "Алгоритми шляхів",
          methods: [
            {
              id: 0,
              method: "hasPath(n1, n2)",
              description: "Повертає, чи існує шлях між вершинами n1 та n2",
            },
            {
              id: 1,
              method: "Dijkstra(n)",
              description:
                "Поступово розширює область від стартової вершини n до всіх інших, завжди обираючи найближчу ще не оброблену вершину. Для стартової вершини відстань встановлюється як 0. Для всіх невідвіданих вершин відстань вважається за нескінченність. Обирається вершина з найменшою відомою відстанню до неї. Алгоритм переглядає всіх сусідів даної вершини. Якщо шлях до сусіда через поточну вершину виявляється коротшим за вже записаний, ця нова відстань записується як мінімальна. Поточна вершина позначається як відвідана і більше не розглядається. Алгоритм повторюється, доки всі вершини не будуть відвідані. Працює тільки з невід'ємними вагами ребер",
            },
            {
              id: 2,
              method: "BellmanFord(n)",
              description:
                "Поступово розширює область від стартової вершини n до всіх інших, навіть якщо є від'ємні ваги, багато разів проходячись по всіх ребрах, щоб покращити знайдені відстані. Для стартової вершини відстань встановлюється як 0. Для всіх невідвіданих вершин відстань вважається за нескінченність. Пройти по всіх ребрах графа. Для кожного ребра перевірити, чи можна покращити (зменшити) відстань до його кінцевої вершини. Якщо можна, то відстань оновлюється і запам'ятовується попередня вершина. Це називаєтсья релаксація. Релаксація повторюється N-1 разів, де N - кількість вершин. Після завершення V − 1 проходів, робиться ще один прохід по всіх ребрах для перевірки на негативні цикли. Якщо відстань до якоїсь вершини все ще може зменшитися, це означає, що в графі є цикл від'ємної ваги, і коректного рішення не існує. Якщо від'ємного циклу немає, то отримані відстані є найкоротшими",
            },
          ],
        },
      ],
    },
  },
};

const hash_TableConfig: structureConfig<"Hash_Table"> = {
  type: "Hash_Table",
  imgURL: hash_tableImg,
  description: (
    <div>
      <h2>Хеш-таблиця</h2>
      <p>
        Хеш-таблиця - це таблична структура даних, яка зберігає інформацію у
        вигляді пар «ключ - значення».
      </p>
      <p>
        Хеш-таблиця працює за принципом словника, дозволяючи миттєво знаходити,
        додавати або видаляти дані.
      </p>
      <p>
        Для визначення місця зберігання елемента використовується хеш-функція -
        алгоритм, який перетворює ключ на числовий хеш-код.
      </p>
      <p>
        Іноді хеш-функція може видати однаковий хеш-код для різних ключів. Це
        явище називаєтья колізією.
      </p>
      <p>Для розв'язання колізій використовуються два основні підходи:</p>
      <dl>
        <dt>
          <h3>Метод ланцюжків</h3>
        </dt>
        <dd>
          У кожній комірці таблиці може зберігатися не один елемент, а список
          елементів, що мають однаковий хеш-код.
        </dd>
        <dt>
          <h3>Відкрита адресація</h3>
        </dt>
        <dd>
          Якщо потрібна комірка зайнята, алгоритм шукає іншу вільну комірку за
          певним правилом
        </dd>
      </dl>
    </div>
  ),
  settings: <div>Settings</div>,
  subType: {
    hashTable: {
      properties: [
        { id: 0, property: "id", description: "Унікальний номер хеш-таблиці" },
        {
          id: 1,
          property: "size",
          description: "Кількість рядків у хеш-таблиці",
        },
        {
          id: 2,
          property: "table",
          description: "Масив рядків таблиці з розміром size",
        },
      ],
      nodeProps: [
        { id: 0, nodeProp: "key", description: "Ключ елемента" },
        { id: 1, nodeProp: "value", description: "Значення елемента" },
        {
          id: 2,
          nodeProp: "next",
          description: "Посилання на наступний елемент рядку",
        },
      ],
      algorithms: [
        {
          id: 0,
          block: "Базові операції",
          methods: [
            {
              id: 0,
              method: "insert(k, v)",
              description: "Додає елемент з ключем k і значенням v",
            },
            {
              id: 1,
              method: "remove(k)",
              description: "Видаляє елемент з ключем k",
            },
            {
              id: 2,
              method: "update(k, v)",
              description: "Оновлює елемент з ключем k на значення v",
            },
            {
              id: 3,
              method: "get(k)",
              description: "Повертає значення елемента з",
            },
            {
              id: 4,
              method: "has(k)",
              description: "Чи є елемента з ключем k",
            },
            {
              id: 5,
              method: "resize()",
              description: "Подвоює розмір рядків хеш-таблиці",
            },
            {
              id: 6,
              method: "hash(k)",
              description: "Обчислює хеш елемента з ключем k",
            },
            {
              id: 7,
              method: "rehash()",
              description: "Перераховує всі хеші елементів після resize",
            },
            {
              id: 8,
              method: "keys()",
              description: "Повертає масив ключів хеш-таблиці",
            },
            {
              id: 9,
              method: "values()",
              description: "Повертає масив значень хеш-таблиці",
            },
            {
              id: 10,
              method: "entries()",
              description: "Повертає масив пар ключ-значення хеш-таблиці",
            },
            { id: 11, method: "clean()", description: "Очищає хеш-таблицю" },
          ],
        },
      ],
    },
  },
};

export const structuresData = [
  arrayConfig,
  listConfig,
  stackConfig,
  queueConfig,
  treeConfig,
  graphConfig,
  hash_TableConfig,
];
